/*--створити масив та вивести його в консоль:
- з 5 числових значень
- з 5 стічкових значень
- з 5 значень стрічкового, числового та булевого типу*/
// let m1=[2.7, 3.14, 4, 5, 6.5555];
// let m2=['555', 'vika', 'roma','name', 'ffff'];
// let m3=['2.7', 3.14, false, true, 0];
//
// console.log(m1);
// console.log(m2);
// console.log(m3);


/*-- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль*/
// let m1=[];
// m1[0]=2;
// m1[1]=3;
// m1[2]=8;
// m1[3]=10;
// m1[4]='dosen';
//
// console.log(m1);

/* - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині*/
// for (let i=0; i<10; i++){
//     document.write('<div>divKA</div>');
// }

/*- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині*/
// for (let i=0; i<10; i++){
//     document.write(`<div>divKA ${i}</div>`);
// }

/*- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.*/
// let i=0;
// while (i<20){
//         document.write(`<h1>hi all</h1>`);
//         i++;
// }

/*- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.*/
// let i=0;
// while (i<20){
//         document.write(`<h1>hi all ${i}</h1>`);
//         i++;
// }

/*- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.*/
// let m1= [25,2,46,64,48,5,36.353, 7652,1,135842.22522];
// for (let i=0; i<m1.length; i++){
// console.log(m1[i]);
// }

/*- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.*/
// let divs= ["div","div1","div2","div3","div4","div5","div6","div7","div8","div9"];
// for (let i=0; i<divs.length; i++){
// console.log(divs[i]);
// }


/*- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.*/
// let mas= [true,48,12.5,null,false,25,true,85,75,false];
// for (let i=0; i<mas.length; i++){
// console.log(mas[i]);
// }




/*- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести
тільки булеві елементи*/
// let mas= [true,48,12.5,null,false,25,true,'go go',75,false];
// for (let i=0; i<mas.length; i++){
//     if ((typeof (mas[i])=="boolean")){
//         console.log(mas[i]);
//     }
//   }

/*- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof
вивести тільки числові елементи*/
// let mas= [true,48,12.5,null,false,25,true,'go go',75,false];
// for (let i=0; i<mas.length; i++){
//     if ((typeof (mas[i])=="number")){
//         console.log(mas[i]);
//     }
//   }

/* - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести
тільки рядкові елементи*/
// let mas= [true,48,12.5,null,false,25,true,'go go',75,false];
// for (let i=0; i<mas.length; i++){
//     if ((typeof (mas[i])=="string")){
//         console.log(mas[i]);
//     }
//   }

/*- Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
Вивести в консоль всі його елементи в циклі.*/
// let m1=[];
// m1[0]=2;
// m1[1]=true;
// m1[2]=false;
// m1[3]=10;
// m1[4]='dosen';
// m1[5]=2;
// m1[6]=true;
// m1[7]=false;
// m1[8]=10;
// m1[9]='dosen';
//
// for (let i = 0;i < m1.length; i++){
//     console.log(m1[i]);
// }

/*- Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write*/
// for (let i = 0;i < 10; i++){
//     console.log(i);
//     document.write( `${i} <br>`);
// }

/*- Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write*/
// for (let i = 0;i < 10; i+=2){
//     console.log(i);
//     document.write( `${i} <br>`);
// }

/*- Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write*/
// for (let i = 0;i < 100; i+=2){
//     console.log(i);
//     document.write( `${i} <br>`);
// }

/*- Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write*/
// for (let i = 0;i < 100; i++){
//     console.log(i);
//     document.write( `${i} <br>`);
// }

/*- Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write*/
// for (let i = 1;i < 100; i+=2){
//     console.log(i);
//     document.write( `${i} <br>`);
// }

/*- Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)*/
// for (let i = 0;i < 2; i++){
//     for (let k=0; k<60;k++){
//         console.log(i, k);
//         document.write( i , ` : ${ k} <br>`);
//     }
// }

/*- Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)*/
// for (let i = 0;i < 3; i++){
//     for (let k=0; k<60;k++){
//         if (i==3||k==21){break}
//         for (let j=0;j<60;j++) {
//             console.log(i,k,j);
//             document.write(` : ${ i} годин(и) `,` : ${ k} хвилин(и) <br>`);
//         }
//     }
// }

// Додатково
/*- Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.*/
// let m= [ 'a', 'b', 'c']
// for (let i=0; i<m.length;i++) {
//     document.write(m[i]);
//     console.log(m[i]); // как в консоль вывести слово????

//    }

/*- Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.*/
// let m= [ 'a', 'b', 'c']
// let i=0;
// while (i <m.length){
//     document.write(m[i]);
//     // console.log(m[i]); //как в консоль вывести слово????
//     i++;
// }

/*- Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.*/
// let m= [ 'a', 'b', 'c'];
// for(let i of m){           ///////////////////////////////возвращает индексы
// console.log(i);
//     document.write(i);
//     console.log(m[i]); //как в консоль вывести слово????
//                        // выводит undefinded???
// i++;
// }

