/*- Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.*/
// let m = ['a', 'b', 'c'];
// let m1 = [1, 2, 3];
// for (let i=0; i<m1.length; i++){
//     m.push(m1[i]);
//    }
//     console.log(m);

/*- Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].*/
// let m = [1, 2, 3];
// let m1 = [];
// for (let i=m.length; i>-1; i--){
//     m1.push(m[i-1]);
//    }
//     m1.pop(4);             /// такое......
//     console.log(m1);          // если без m1.pop(4); то получается [3, 2, 1, undefined]  undefined- непонятно!!

/*- Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.*/
// let m = [1, 2, 3];
// let m1 = [4, 5, 6];
// for (let i=0; i<m1.length; i++){
//     m.push(m1[i]);
//    }
//     console.log(m);

/*- Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.*/
// let m = [1, 2, 3];
// let m1 = [4, 5, 6];
// for (let i=0; i<m1.length; i++){
//     m.unshift(m1[i]);
//    }
//     console.log(m);
//
// // Вставляет с начала но в обратном порядке.
// // как вставить в прямой последовательности??

/*- Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()*/
// let m = ['js', 'css', 'jq'];
// console.log(m);
// //Как? shift - для удаления элемента сначала, unshift для вставки элемента в начало
// // он же ничего не возвращает. если использовать pop -можно удалить с конца 2 элемента
// //и вывести оставшийся 0-вой, или вывести только один элемент с индексом 1.
// //Вопрооос???

/*- Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()*/
// let m = ['js', 'css', 'jq'];
// console.log(m);
// //Как? pop - для удаления элемента с конца, push для вставки элемента в конец
// //Вопрос такой же как и в предидущем зазании???

/*- Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].*/
// let m = [1, 2, 3, 4, 5];
// let m1 = m.slice(2,4) ;
// console.log(m);
// console.log(m1);

/*- Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].*/
// let m = [1, 2, 3, 4, 5];
// let m1 = m.slice(0,2);
// console.log(m);   // исходный массив
// console.log(m1); // новый урезаный массив

/*- Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].*/
// let m = [1, 2, 3, 4, 5];
// let m1 = m.splice(1,2) ;
// console.log(m);
// console.log(m1);/// возвращает массив удалённых элементов


/*- Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].*/
// let m = [1, 2, 3, 4, 5];
//
// m.splice(2,0,'a', 'b', 'c');
// console.log(m);

/*- Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив[1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].*/
// let m = [1, 2, 3, 4, 5];
// m.splice(1,0,'a', 'b');
// m.splice(6,0,'c');
// m.splice(8,0,'e');
// console.log(m);

/*- Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.*/
// let m = [1,52,64,96,25,45,375,66,22,46]
// for (let i = 0; i< m.length; i++){
// if( m[i]%2==0) {
//     console.log(m[i]);
// }
//     }

/*- Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push ()
скопіювати значення одного масиву в інший*/
// let m = [1,52,64,96,25,45,375,66,22,46];
// let m1 =[];
// for (let i=0; i < m.length;i++){
//       m1.push(m[i]);
// }
// console.log(m);
// console.log(m1);

/*- Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати
значення одного масиву в інший.*/
// let m = [1,52,64,96,25,45,375,66,22,46];
// let m1 =[];
// for (let i=0; i< m.length;i++){
//       m1.push(m[i]);                         //// сомневаюсь, но всё же))
// }
// console.log(m1);

/*============*/

/*зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:*/
/*1. перебрати його циклом while*/
// let m =[2,17,13,6,22,31,45,66,100,-18];
// let i=0;
// while (i< m.length){
//     console.log(m[i]);
//     i++
// }

/*2. перебрати його циклом for*/
// let m =[2,17,13,6,22,31,45,66,100,-18];
// for(let i=0;i< m.length;i++){
//     console.log(m[i]);
// }

/*3. перебрати циклом while та вивести  числа тільки з непарним індексом*/
// let m =[2,17,13,6,22,31,45,66,100,-18];
// let i = 0;
// while (i<m.length){
//     if (i%2!==0)
//     console.log(m[i]);
//     i++;
// }

/*4. перебрати циклом for та вивести  числа тільки з непарним індексом*/
// let m =[2,17,13,6,22,31,45,66,100,-18];
// for(let i=0;i< m.length;i++){
//     if (i%2!==0)
//     console.log(m[i]);
// }

/*5. перебрати циклом while та вивести  числа тільки парні  значення*/
// let m =[2,17,13,6,22,31,45,66,100,-18];
// let i = 0;
// while (i<m.length){
//     if (m[i]%2==0)
//     console.log(m[i]);
//     i++;
// }

/*6. перебрати циклом for та вивести  числа тільки парні  значення*/
// let m =[2,17,13,6,22,31,45,66,100,-18];
// for(let i=0;i< m.length;i++){
//     if (m[i]%2==0)
//     console.log(m[i]);
// }

/*7. замінити кожне число кратне 3 на слово "okten"*/
// let m =[2,17,13,6,22,31,45,66,100,-18];
// for(let i=0;i< m.length;i++){
//     if (m[i]%3==0){
//         m[i]= 'okten';
//         console.log(m[i]);
//     }
// }
// console.log(m);

/*8. вивести масив в зворотньому порядку.*/

// let m =[2,17,13,6,22,31,45,66,100,-18];
// for(let i=m.length;i>-1;i--){    //
//        console.log(m[i]);                           //вывел в обратном порядке в консоль
// }                                                   // как вывести массив пока незнаю
// console.log(m);

/*9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)*/
/*9.1 перебрати його циклом while */
// let m =[2,17,13,6,22,31,45,66,100,-18];
// let i=m.length;
// while (i>-1){
//     console.log(m[i]);
//     i--;
// }

/*9.2 перебрати його циклом for */
// let m =[2,17,13,6,22,31,45,66,100,-18];
// for(let i=m.length;i>-1;i--){
//     console.log(m[i]);
// }

/*9.3 перебрати циклом while та вивести  числа тільки з непарним індексом */
// let m =[2,17,13,6,22,31,45,66,100,-18];
// let i=m.length;
// while (i>-1){
//     if (i%2!==0)
//     console.log(m[i]);
//     i--;
// }

/*9.4 перебрати циклом for та вивести  числа тільки з непарним індексом */
// let m =[2,17,13,6,22,31,45,66,100,-18];
// for(let i=m.length;i>-1;i--){
//     if (i%2!==0)
//     console.log(m[i]);
// }

/*9.5 перебрати циклом while та вивести  числа тільки парні  значення */
// let m =[2,17,13,6,22,31,45,66,100,-18];
// let i=m.length;
// while (i>-1){
//     if (m[i]%2==0)
//     console.log(m[i]);
//     i--;
// }

/*9.6 перебрати циклом for та вивести  числа тільки парні  значення */
// let m =[2,17,13,6,22,31,45,66,100,-18];
// for(let i=m.length;i>-1;i--){
//     if (m[i]%2==0)
//     console.log(m[i]);
// }

/*9.7 замінити кожне число кратне 3 на слово "okten" */
// let m =[2,17,13,6,22,31,45,66,100,-18];
// for(let i=m.length;i>-1;i--){
//        if (m[i]%3==0){
//         m[i]= 'okten';
//         console.log(m[i]);
//     }
// }
// console.log(m);


/*10 створити пустий масив та :
/*1. заповнити його 50 парними числами за допомоги циклу.*/
// let m =[];
// for(let i=0;i<100;i+=2){
//     m.push(i);
//     console.log(m[i]);
// }
// console.log(m);

/*2. заповнити його 50 непарними числами за допомоги циклу.*/
// let m =[];
// for(let i=0;i<100;i++){
//     if(i%2!==0) {
//         m.push(i);
//     }
//     console.log(m[i]);
// }
// console.log(m);

/*3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
    диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)*/
// let m =[];
// for(let i=0;i < 50;i++){
//         m.push(Math.round(Math.random() * (732 - 8 + 1) + 8));
//         // console.log(m[i]);
// }
// console.log(m);                   /// масств віводит, а отдельно\пошагово элементы не получается

/*2. вывести на консоль  каждый третий елемент*/
// let m =[];
// for(let i=0;i < 50;i+=3){
//    let k= m.push(Math.round(Math.random() * (732 - 8 + 1) + 8));
//        console.log(k)
// }
// // console.log(m);

/*3. вывести на консоль  каждый третий елемент но при условии что его значение является парным.*/
// let m =[];
// for(let i=0;i < 50;i+=3){
//    let k=Math.round(Math.random() * (732 - 8 + 1) + 8);
//        if(k%2==0){
//        m.push(k);
//        console.log(k)
//    }
// }
// console.log(m);

/*4. вывести на консоль  каждый третий елемент но при условии что он имеет парное значение и записать их в другой массив.*/
// let m =[];
// let m1=[];
// for(let i=0;i < 50;i+=3){
//    let k=Math.round(Math.random() * (732 - 8 + 1) + 8);
//    if(k%2==0) {
//        m.push(k);
//        console.log(k);
//    }
// }
// for(let i=0;i < m.length;i++) {
//     m1.push(m[i]);
//     console.log(m[i]);
// }

/*5. Вывести каждый елемент массива у которого соседний с права элемент - парный*/
// let m = [];
// for (let i = 0; i < 50; i += 3) {
//     let k = Math.round(Math.random() * (732 - 8 + 1) + 8);
//     if ((k) % 2 == 0) {
//         m.push(k);     /// заполнение массива
//     }
// }
// console.log(m);
// for (let j = 0; j < m.length; j++)
//     if ((m[j + 1]) % 2 == 0) {
//         console.log(m[j])
//     }

/*5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.*/


/*3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.*/
// let m =[];
// let m1=[];
// for(let i=0;i < 50;i+=3){
//     let k=Math.round(Math.random() * (732 - 8 + 1) + 8);
//         m.push(k);                                            /// заполнение массива
// }
// console.log(m);                                                /// вывод в консоль первого массива
// for(let i=0;i < m.length;i++) {
//     m1.push(m[i]*5);
// }
// console.log(m1);

/*4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
додати його в інший масив.*/
let m = [true,48,12.5,null,false,25,true,'go go',75,false];
let m1 = [];
for (let i = 0; i < m.length; i++){
    if (typeof (m[i]) == 'number'){
        m1.push(m[i]);
    }
}
console.log(m);
console.log(m1)


